export default {
  state: {
    books: [
      {
        id: "1",
        title: "Эрагон ",
        desc:
          "В волшебных лесах родной Алагейзии деревенский мальчик по имени Эрагон находит удивительной красоты голубой камень. Он собирается продать его, чтобы помочь своей семье пережить зиму. К его изумлению, камень оказывается яйцом, из которого вылупляется прекрасный дракон, которого он называет Сапфира. В одну из ночей жизнь этого простого мальчишки полностью переворачивается - с его семьей жестоко расправляются темные силы, которые обитают в королевстве. От старика-сказочника Брома Эрагон узнает о своем особом предназначении - он Всадник Драконов. ",

        author: "Кристофер Паолини",
        series: " Эрагон",
        status: "readed",
        genr: ["Fantasy", "Romantic"],
        img: "http://www.hdclub.ua/files/film_poster/big/bigi4d6043a4d67e0.jpg",
        part: "4",
        rating: "5",
        youtube: "https://www.youtube.com/watch?v=oGgdrB609HM",
        parts: [
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "1q5236475",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "image",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "charapter",
          },
        ],
      },
      {
        id: "2",
        title: "Эрагон Возвращение  ",
        desc:
          "В волшебных лесах родной Алагейзии деревенский мальчик по имени Эрагон находит удивительной красоты голубой камень. Он собирается продать его, чтобы помочь своей семье пережить зиму. К его изумлению, камень оказывается яйцом, из которого вылупляется прекрасный дракон, которого он называет Сапфира. В одну из ночей жизнь этого простого мальчишки полностью переворачивается - с его семьей жестоко расправляются темные силы, которые обитают в королевстве. От старика-сказочника Брома Эрагон узнает о своем особом предназначении - он Всадник Драконов. ",

        author: "Кристофер Паолини",
        series: " Эрагон",
        status: "readed",
        genr: ["Fantasy", "Romantic", "Action"],
        img:
          "https://avatars.mds.yandex.net/get-pdb/1996997/9d332ff9-2c5a-487b-af23-5d41f25af8f3/s375",
        part: "2",
        rating: "5",
        youtube: "https://www.youtube.com/watch?v=oGgdrB609HM",
        parts: [
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "1q5236475",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "image",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "charapter",
          },
        ],
      },
      {
        id: "3",
        title: "Эрагон Брисингр ",
        desc:
          "В волшебных лесах родной Алагейзии деревенский мальчик по имени Эрагон находит удивительной красоты голубой камень. Он собирается продать его, чтобы помочь своей семье пережить зиму. К его изумлению, камень оказывается яйцом, из которого вылупляется прекрасный дракон, которого он называет Сапфира. В одну из ночей жизнь этого простого мальчишки полностью переворачивается - с его семьей жестоко расправляются темные силы, которые обитают в королевстве. От старика-сказочника Брома Эрагон узнает о своем особом предназначении - он Всадник Драконов. ",

        author: "Кристофер Паолини",
        series: " Эрагон",
        status: "readed",
        genr: ["Fantasy", "Future"],
        img:
          "https://www.vokrug.tv/pic/product/b/4/5/5/b455f979d98275e433a02cf2099e88db.jpeg",
        part: "3",
        rating: "5",
        youtube: "https://www.youtube.com/watch?v=oGgdrB609HM",
        parts: [
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "1q5236475",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "image",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "charapter",
          },
        ],
      },
      {
        id: "4",
        title: "Эрагон Наследие ",
        desc:
          "В волшебных лесах родной Алагейзии деревенский мальчик по имени Эрагон находит удивительной красоты голубой камень. Он собирается продать его, чтобы помочь своей семье пережить зиму. К его изумлению, камень оказывается яйцом, из которого вылупляется прекрасный дракон, которого он называет Сапфира. В одну из ночей жизнь этого простого мальчишки полностью переворачивается - с его семьей жестоко расправляются темные силы, которые обитают в королевстве. От старика-сказочника Брома Эрагон узнает о своем особом предназначении - он Всадник Драконов. ",

        author: "Кристофер Паолини",
        series: " Эрагон",
        status: "readed",
        genr: ["Fantasy", "Romantic", "History"],
        img: "http://www.hdclub.ua/files/film_poster/big/bigi4d6043a4d67e0.jpg",
        part: "4",
        rating: "5",
        youtube: "https://www.youtube.com/watch?v=oGgdrB609HM",
        parts: [
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "1q5236475",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "image",
          },
          {
            id: "4325322",
            title: "Eragon",
            youtubeId: "charapter",
          },
        ],
      },
    ],
    bookParts: [
      {
        bookId: "123",
        bookPartId: "123123",
        bookTitle: "21321231",
        youtubeId: "444444",
        partTitle: "1111111",
        content: [
          {
            sentences: [
              {
                origText: "421421",
                transText: "15645",
              },
            ],
          },
        ],
      },
    ],
  },
  actions: {},
  mutations: {
    setBooks(state, payload) {
      state.books = payload;
    },
  },
  getters: {
    getBooks: state => state.books,
    getParts: state => state.bookParts,
  },
};
